<template>
	<view>
		<view>
			<button @click="btn">按钮点击</button>
			而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈而恶化我昂发达国家放电饭锅地方国际饭店大家风哥梵蒂冈
		</view>
		<!-- 移动区域 -->
		<movable-area class="movable-area">
			<!-- 移动块 -->
		    <movable-view class="movable-view" :x="x" :y="y" direction="all" @change="onChange">
				<!-- 自定义内容 -->
				<button class="movable-btn" @click="movableBtnFun">拖动</button>
			</movable-view>
		</movable-area>
	</view>
</template>

<script>
	export default{
		data() {
			return {
				x: 0,
				y: 0
			}
		},
		methods: {
			// 拖动按钮的移动事件， 可获取移的参数
			onChange: function(e) {
				console.log(e.detail)
			},
			
			// 页面按钮点击事件
			btn() {
				console.log('123')
			},
			
			// 拖动按钮点击事件
			movableBtnFun() {
				console.log(555)
			}
		}
	}
</script>

<style lang="scss" scoped>
	.movable-area {
		width: 100vw;
		height: 100vh;
		position: fixed;
		top: 0;
		left: 0;
		pointer-events: none;  //表示可穿透层，并指指向当前点击后面的元素
		.movable-view {
			pointer-events: auto;   //表示不可穿透层
			width: 100rpx;
			height: 100rpx;
			border-radius: 50%;
			.movable-btn {
				width: 100%;
				height: 100%;
				border-radius: 50%;
				background: rgba(255, 0, 155, 0.5);
				padding: 0;
				line-height: 100rpx;
				font-size: 28rpx;
				color: #fff;
			}
		}
	}
</style>
